import React, { useState } from "react";
import "./style.scss";

const ques = [
    "Где можно узнать стоимость доставки товара?",
    "Как узнать, где находится заказанный товар?",
    "Можно ли заказать доставку на определённый день?",
    "Как узнать о наличии товара в избранном?",
    "Как делать возврат?",
    "Хочу скидку! Какие варианты её получения?",
    "Можно ли ускорить доставку?",
    "Как отказаться от заказанного товара?",
];

const answer = [
    "Узнать стоимость можно, рассчитав доставку на главной странице или при оформлении заказа!",
    "Вы можете посмотреть в личном кабинете, в разделе заказов, выбрав интересующий товар!",
    "Можно! При оформлении заказа выберите определенный день и время доставки.",
    "Вы можете проверить наличие если зайдете в личный кабинет, раздел избранных товаров",
    "Если Вам необходимо сделать возврат, напишите в чат подержки в личном кабинете!",
    "У нас есть скидки по промокодам, для их получения следите за нашими новостями!",
    "Ускорить доставку можно выбрав “срочная доставка”, при оформлении заказа!",
    "Если Вы хотите отказаться от заказа, напишите в чат подержки в личном кабинете!",
];

const listDefault = [
    { type: "", value: "Здравствуйте, я ваш помощник из службы поддержки." },
    { type: "", value: "Какой у вас вопрос?" },
];

function ChatHelper() {
    const [list, setList] = useState([
        { type: "", value: "Здравствуйте, я ваш помощник из службы поддержки." },
        { type: "", value: "Какой у вас вопрос?" },
    ]);

    const [show, setShow] = useState(false);

    const handleClickQues = (index) => {
        setList((data) => [...data, { type: "user", value: ques[index] }, { type: "bot", value: answer[index] }]);
    };

    const handleClose = () => {
        setShow(false);
        setList(listDefault);
    };

    return (
        <div className="chat-helper">
            <button className="chat-helper__button" onClick={() => setShow(true)}>
                <img src="/img/chat-helper.svg" alt="" />
            </button>
            {show == true && (
                <div className="chat-helper__content">
                    <div className="chat-helper__list">
                        {list?.map((v, i) => (
                            <p className={"chat-helper__item chat-helper__item_" + v.type} key={i}>
                                {v.value}
                            </p>
                        ))}
                        <div className="chat-helper__block-ques">
                            {ques?.map((v, i) => (
                                <p className="chat-helper__ques" key={i} onClick={() => handleClickQues(i)}>
                                    {v}
                                </p>
                            ))}
                        </div>
                    </div>
                    <p className="chat-helper__label">Выберите вопрос из списка</p>
                    <button className="chat-helper__close" onClick={() => handleClose()}>
                        <svg width="23.000000" height="23.000000" viewBox="0 0 23 23" fill="none">
                            <desc>Created with Pixso.</desc>
                            <defs />
                            <path
                                id="cancle-color"
                                d="M13.52 11.49L22.57 2.46C22.84 2.19 22.99 1.82 22.99 1.44C22.99 1.05 22.84 0.69 22.57 0.42C22.3 0.15 21.93 0 21.55 0C21.17 0 20.8 0.15 20.53 0.42L11.5 9.47L2.46 0.42C2.19 0.15 1.82 0 1.44 0C1.06 0 0.69 0.15 0.42 0.42C0.15 0.69 0 1.05 0 1.44C0 1.82 0.15 2.19 0.42 2.46L9.47 11.49L0.42 20.53C0.29 20.66 0.18 20.82 0.11 21C0.03 21.17 0 21.36 0 21.55C0 21.74 0.03 21.93 0.11 22.1C0.18 22.28 0.29 22.44 0.42 22.57C0.55 22.7 0.71 22.81 0.89 22.88C1.06 22.96 1.25 23 1.44 23C1.63 23 1.82 22.96 1.99 22.88C2.17 22.81 2.33 22.7 2.46 22.57L11.5 13.52L20.53 22.57C20.66 22.7 20.82 22.81 21 22.88C21.17 22.96 21.36 23 21.55 23C21.74 23 21.93 22.96 22.1 22.88C22.28 22.81 22.44 22.7 22.57 22.57C22.7 22.44 22.81 22.28 22.88 22.1C22.96 21.93 23 21.74 23 21.55C23 21.36 22.96 21.17 22.88 21C22.81 20.82 22.7 20.66 22.57 20.53L13.52 11.49Z"
                                fill="#000"
                            />
                        </svg>
                    </button>
                </div>
            )}
        </div>
    );
}

export default ChatHelper;
